src/Catalogs/ШаблоныАктивности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ШаблоныАктивности</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПериодыАктивности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяНач</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяКон</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Станция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Станции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Станции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Станция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Станции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расписание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Расписания</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действует</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДниНедели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ДниНедели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИндивидуальнаяНастройкаАктивности</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действует</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ШаблоныАктивности/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Станции.Количество()=0 Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	Станции.Ссылка КАК Станция,
		|	ИСТИНА КАК Действует
		|ИЗ
		|	Справочник.Станции КАК Станции
		|ГДЕ
		|	НЕ Станции.ПометкаУдаления");
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЕСТЬNULL(Станции.Ссылка, ШаблоныАктивностиСтанции.Станция) КАК Станция,
		|	ЕСТЬNULL(ШаблоныАктивностиСтанции.Действует, ИСТИНА) КАК Действует,
		|	ШаблоныАктивностиСтанции.Расписание
		|ИЗ
		|	Справочник.ШаблоныАктивности.Станции КАК ШаблоныАктивностиСтанции
		|		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.Станции КАК Станции
		|		ПО ШаблоныАктивностиСтанции.Станция = Станции.Ссылка
		|ГДЕ
		|	ЕСТЬNULL(ШаблоныАктивностиСтанции.Ссылка, &Ссылка) = &Ссылка //ИЛИ &Ссылка = Значение(Справочник.ШаблоныАктивности.ПустаяСсылка)");
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	КонецЕсли;
	Объект.Станции.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаСервере
Процедура УстановитьОбщееРасписаниеНаСервере()
	КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбщееРасписание(Команда)
	Расписание = ОткрытьФормуМодально("Справочник.Расписания.ФормаВыбора");
	Для Каждого Т Из Объект.Станции Цикл 
		Т.Расписание = Расписание;
	КонецЦикла;
	УстановитьОбщееРасписаниеНаСервере();
КонецПроцедуры
